Revit 2027 API
DuctSettings.RectangularDuctSizeSeparator Property
 The rectangular duct size separator string.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string RectangularDuctSizeSeparator { get; set; }
Public Property RectangularDuctSizeSeparator As String
	Get
	Set
public:
property String^ RectangularDuctSizeSeparator {
	String^ get ();
	void set (String^ value);
}
member RectangularDuctSizeSeparator : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
DuctSettings Class
Autodesk.Revit.DB.Mechanical Namespace